In [1]:
import pandas as pd

In [5]:
data={'Students' :['Amit','Anam','Chi','Sam','Ravi','Jai'],
'Marks' :[85,None,65,75,None,55]}

In [9]:
df=pd.DataFrame(data)
print('Original Data')
df

Original Data

  Students  Marks
0     Amit   85.0
1     Anam    NaN
2      Chi   65.0
3      Sam   75.0
4     Ravi    NaN
5      Jai   55.0

In [12]:
print('Missing Data')
print('Number of missing values are:',df.isnull().sum())

Missing Data
Number of missing values are: Students    0
Marks       2
dtype: int64

In [14]:
average_marks=df['Marks'].mean()
print(average_marks)

70.0

In [15]:
df.fillna(average_marks, inplace=True)

In [17]:
print('After fillna() call')
df

After fillna() call

  Students  Marks
0     Amit   85.0
1     Anam   70.0
2      Chi   65.0
3      Sam   75.0
4     Ravi   70.0
5      Jai   55.0

In [25]:
students_data={'Name' :['Amit','Anam','Chi','Sam','Ravi','Jai'],
'Marks' :[85,None,65,75,None,55]}
df=pd.DataFrame(students_data)

In [23]:
df.fillna(df['Marks'].mean(), inplace=True)

In [24]:
df

   Name  Marks
0  Amit   85.0
1  Anam   70.0
2   Chi   65.0
3   Sam   75.0
4  Ravi   70.0
5   Jai   55.0

# dropna() example

In [29]:
students_data={'Name' :['Amit','Anam','Chi','Sam','Ravi','Jai'],
'Marks' :[85,None,65,75,None,55]}
df=pd.DataFrame(students_data)
print('Original Data')
df

Original Data

   Name  Marks
0  Amit   85.0
1  Anam    NaN
2   Chi   65.0
3   Sam   75.0
4  Ravi    NaN
5   Jai   55.0

In [27]:
df=df.dropna(subset=['Marks'])

In [28]:
print('Dataset after dropna()')
df

Dataset after dropna()

   Name  Marks
0  Amit   85.0
2   Chi   65.0
3   Sam   75.0
5   Jai   55.0

In [30]:
emp_data={
    "Name":['Sam','Ali','Chang','Xi','Viz','Suhail'],
    "Age":[35,None,25,20,24,None],
    "Salary":[50000,30000,20000,40000,None,None]
}
df=pd.DataFrame(emp_data)
print('Original Data')
df

Original Data

     Name   Age   Salary
0     Sam  35.0  50000.0
1     Ali   NaN  30000.0
2   Chang  25.0  20000.0
3      Xi  20.0  40000.0
4     Viz  24.0      NaN
5  Suhail   NaN      NaN

In [31]:
print(df.isnull().sum())

Name      0
Age       2
Salary    2
dtype: int64

In [32]:
df_drop=df.dropna()
df_drop

    Name   Age   Salary
0    Sam  35.0  50000.0
2  Chang  25.0  20000.0
3     Xi  20.0  40000.0

In [34]:
df_drop_salary=df.dropna(subset=['Salary'])
df_drop_salary

    Name   Age   Salary
0    Sam  35.0  50000.0
1    Ali   NaN  30000.0
2  Chang  25.0  20000.0
3     Xi  20.0  40000.0

In [44]:
df.fillna({'Age': df['Age'].mean(), 'Salary': df['Salary'].mean()}, inplace=True)
df

     Name   Age   Salary
0     Sam  35.0  50000.0
1     Ali  26.0  30000.0
2   Chang  25.0  20000.0
3      Xi  20.0  40000.0
4     Viz  24.0     26.0
5  Suhail  26.0     26.0